In [1]:
import pandas as pd

In [5]:
dict1={"name":["roshani","sagar","rakesh","ratan","ratan","mina"],"salary":[12000,34500,5600,6700,6700,4000],"perfomance":[23,2,3,5,5,9]}
dict1

{'name': ['roshani', 'sagar', 'rakesh', 'ratan', 'ratan', 'mina'],
 'salary': [12000, 34500, 5600, 6700, 6700, 4000],
 'perfomance': [23, 2, 3, 5, 5, 9]}

In [6]:
df=pd.DataFrame(dict1)
df

      name  salary  perfomance
0  roshani   12000          23
1    sagar   34500           2
2   rakesh    5600           3
3    ratan    6700           5
4    ratan    6700           5
5     mina    4000           9

In [7]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [14]:
# Removing Duplicates
# To remove duplicates, use the drop_duplicates() method.


df.drop_duplicates(inplace=True)
df

      name  salary  perfomance
0  roshani   12000          23
1    sagar   34500           2
2   rakesh    5600           3
3    ratan    6700           5
5     mina    4000           9